Revit 2027 API
ParameterUtils.GetBuiltInParameter Method
 Gets the BuiltInParameter value corresponding to built-in parameter identified by the given ForgeTypeId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BuiltInParameter GetBuiltInParameter(
	ForgeTypeId parameterTypeId
)
Public Shared Function GetBuiltInParameter (
	parameterTypeId As ForgeTypeId
) As BuiltInParameter
public:
static BuiltInParameter GetBuiltInParameter(
	ForgeTypeId^ parameterTypeId
)
static member GetBuiltInParameter :
        parameterTypeId : ForgeTypeId -> BuiltInParameter
Parameters
parameterTypeId ForgeTypeId
The parameter identifier.
Return Value
BuiltInParameter
The BuiltInParameter value corresponding to the given parameter identifier.
Exceptions
Exception | Condition
ArgumentException |  parameterTypeId is not a built-in parameter identifier. See IsBuiltInParameter(ForgeTypeId) and GetParameterTypeId(BuiltInParameter).
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace